Repository: shotpaste/shotpaste
Catalog: resources/localization/Features/Recording.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, vi, zh_hans, zh_hant

# recording.transcription.source-language-title
source: Spoken Language
de: Gesprochene Sprache
es: Idioma hablado
fr: Langue parlée
ja: 録画の音声言語
ko: 녹화 음성 언어
ru: Язык речи
vi: Ngôn ngữ lời nói
zh_hans: 录屏语音语言
zh_hant: 錄影語音語言

# recording.transcription.source-language-description
source: Currently supports Chinese and English
de: Derzeit werden Chinesisch und Englisch unterstützt
es: Actualmente admite chino e inglés
fr: Prend actuellement en charge le chinois et l’anglais
ja: 現在は中国語と英語に対応しています
ko: 현재 중국어와 영어를 지원합니다
ru: Сейчас поддерживаются китайский и английский
vi: Hiện hỗ trợ tiếng Trung và tiếng Anh
zh_hans: 当前支持中文和英文
zh_hant: 目前支援中文與英文

# recording.transcription.language-chinese
source: Chinese
de: Chinesisch
es: Chino
fr: Chinois
ja: 中国語
ko: 중국어
ru: Китайский
vi: Tiếng Trung
zh_hans: 中文
zh_hant: 中文

# recording.transcription.language-english
source: English
de: Englisch
es: Inglés
fr: Anglais
ja: 英語
ko: 영어
ru: Английский
vi: Tiếng Anh

# recording.transcription.privacy-description
source: When enabled, recorded audio is sent to Volcengine for transcription; video frames stay on your device. AI processing sends transcript text to the configured Agent API.
de: Wenn aktiviert, wird Audio zur Transkription an Volcengine gesendet; Videobilder bleiben lokal. Die KI-Verarbeitung sendet Transkripttext an die konfigurierte Agent-API.
es: Al activarla, el audio se envía a Volcengine; las imágenes de vídeo permanecen en el dispositivo. El procesamiento con IA envía el texto a la API del Agent configurada.
fr: Si activée, la transcription envoie l’audio à Volcengine ; les images restent sur l’appareil. Le traitement IA envoie le texte à l’API Agent configurée.
ja: 有効にすると音声がVolcengineに送信されます。映像は端末に保持されます。AI処理では文字起こしが設定済みのAgent APIに送信されます。
ko: 활성화하면 오디오가 Volcengine으로 전송되며 영상은 기기에 남습니다. AI 처리 시 텍스트가 설정된 Agent API로 전송됩니다.
ru: При включении аудио передаётся в Volcengine; видеокадры остаются на устройстве. Обработка ИИ отправляет текст в настроенный API Agent.
vi: Khi bật, âm thanh được gửi tới Volcengine; khung hình vẫn ở thiết bị. Xử lý AI gửi văn bản tới API Agent đã cấu hình.
zh_hans: 开启后将录制的音频发送至火山引擎转写，视频画面保留在本机。智能处理会将文字稿发送至配置的 Agent API。
zh_hant: 開啟後將錄製的音訊傳送至火山引擎轉寫，影片畫面保留在本機。智慧處理會將文字稿傳送至配置的 Agent API。

# recording.transcription.credential-save-failed
source: Could not save the API Key securely. Check the credential and try again.
de: Der API-Schlüssel konnte nicht sicher gespeichert werden. Prüfen Sie die Anmeldedaten und versuchen Sie es erneut.
es: No se pudo guardar la clave de API de forma segura. Revisa la credencial e inténtalo de nuevo.
fr: Impossible d’enregistrer la clé API de manière sécurisée. Vérifiez l’identifiant et réessayez.
ja: API Key を安全に保存できませんでした。認証情報を確認してもう一度お試しください。
ko: API 키를 안전하게 저장할 수 없습니다. 자격 증명을 확인하고 다시 시도하세요.
ru: Не удалось безопасно сохранить ключ API. Проверьте учетные данные и повторите попытку.
vi: Không thể lưu khóa API an toàn. Hãy kiểm tra thông tin xác thực rồi thử lại.
zh_hans: 无法安全保存 API Key，请检查凭证后重试。
zh_hant: 無法安全儲存 API Key，請檢查憑證後再試一次。

# recording.transcription.window-title
source: ShotPaste · Recording Transcript
de: ShotPaste · Aufnahmetranskript
es: ShotPaste · Transcripción de la grabación
fr: ShotPaste · Transcription de l’enregistrement
ja: ShotPaste · 録画の文字起こし
ko: ShotPaste · 녹화 녹취록
ru: ShotPaste · Расшифровка записи
vi: ShotPaste · Bản chép lời ghi màn hình
zh_hans: ShotPaste · 录屏文字稿
zh_hant: ShotPaste · 螢幕錄影逐字稿

# recording.transcription.processing-title
source: Generating Transcript
de: Transkript wird erstellt
es: Generando transcripción
fr: Génération de la transcription
ja: 文字起こしを生成中
ko: 녹취록 생성 중
ru: Создание расшифровки
vi: Đang tạo bản chép lời
zh_hans: 正在生成文字稿
zh_hant: 正在產生逐字稿

# recording.transcription.processing-description
source: ShotPaste is transcribing the recording audio with Volcengine.
de: ShotPaste transkribiert die Audiospur mit Volcengine.
es: ShotPaste está transcribiendo el audio de la grabación con Volcengine.
fr: ShotPaste transcrit l’audio de l’enregistrement avec Volcengine.
ja: ShotPaste が Volcengine で録画音声を文字起こししています。
ko: ShotPaste가 Volcengine으로 녹화 오디오를 변환하고 있습니다.
ru: ShotPaste расшифровывает звук записи с помощью Volcengine.
vi: ShotPaste đang dùng Volcengine để chép lời âm thanh của bản ghi.
zh_hans: ShotPaste 正在使用火山引擎转写录屏音轨。
zh_hant: ShotPaste 正在使用火山引擎轉寫螢幕錄影音軌。

# recording.transcription.processing-privacy-note
source: Only the audio track is sent; video frames are not uploaded. Processing takes approximately the recording's playback duration.
de: Nur die Audiospur wird gesendet; Videobilder werden nicht hochgeladen. Die Verarbeitung dauert ungefähr so lange wie die Wiedergabe.
es: Solo se envía la pista de audio; los fotogramas de vídeo no se suben. El proceso tarda aproximadamente lo mismo que la reproducción.
fr: Seule la piste audio est envoyée ; les images vidéo ne sont pas téléversées. Le traitement dure environ aussi longtemps que la lecture.
ja: 音声トラックだけを送信し、映像フレームはアップロードしません。処理時間は録画の再生時間とほぼ同じです。
ko: 오디오 트랙만 전송하며 비디오 프레임은 업로드하지 않습니다. 처리 시간은 녹화 재생 시간과 비슷합니다.
ru: Отправляется только аудиодорожка; кадры видео не загружаются. Обработка занимает примерно столько же времени, сколько воспроизведение записи.
vi: Chỉ gửi bản âm thanh, không tải khung hình video lên. Thời gian xử lý xấp xỉ thời lượng phát của bản ghi.
zh_hans: 只发送音轨，不上传视频画面；处理时长大致等于录屏播放时长。
zh_hant: 只傳送音軌，不上傳影片畫面；處理時間大致等於螢幕錄影播放時間。

# recording.transcription.completed-title
source: Transcript Ready
de: Transkript ist fertig
es: Transcripción lista
fr: Transcription prête
ja: 文字起こしが完了しました
ko: 녹취록 준비 완료
ru: Расшифровка готова
vi: Bản chép lời đã sẵn sàng
zh_hans: 文字稿已生成
zh_hant: 逐字稿已產生

# recording.transcription.completed-description
source: Review the text, then copy it or save it as a separate text file.
de: Prüfen Sie den Text und kopieren oder speichern Sie ihn anschließend als separate Textdatei.
es: Revisa el texto y después cópialo o guárdalo como un archivo de texto independiente.
fr: Vérifiez le texte, puis copiez-le ou enregistrez-le dans un fichier texte séparé.
ja: 内容を確認してから、コピーするか別のテキストファイルとして保存できます。
ko: 텍스트를 확인한 뒤 복사하거나 별도의 텍스트 파일로 저장하세요.
ru: Проверьте текст, затем скопируйте его или сохраните отдельным текстовым файлом.
vi: Kiểm tra văn bản, sau đó sao chép hoặc lưu thành tệp văn bản riêng.
zh_hans: 检查文字后，可复制或单独保存为文本文件。
zh_hant: 檢查文字後，可複製或另存為文字檔案。

# recording.transcription.failed-title
source: Transcription Failed
de: Transkription fehlgeschlagen
es: Error de transcripción
fr: Échec de la transcription
ja: 文字起こしに失敗しました
ko: 녹취록 생성 실패
ru: Не удалось создать расшифровку
vi: Không thể tạo bản chép lời
zh_hans: 文字稿生成失败
zh_hant: 逐字稿產生失敗

# recording.transcription.failed-description
source: The video recording was saved safely and will not be changed.
de: Die Videoaufnahme wurde sicher gespeichert und wird nicht verändert.
es: La grabación de vídeo se ha guardado de forma segura y no se modificará.
fr: L’enregistrement vidéo a été sauvegardé et ne sera pas modifié.
ja: 動画の録画は安全に保存され、変更されません。
ko: 비디오 녹화는 안전하게 저장되었으며 변경되지 않습니다.
ru: Видеозапись безопасно сохранена и не будет изменена.
vi: Bản ghi video đã được lưu an toàn và sẽ không bị thay đổi.
zh_hans: 视频录屏已安全保存且不会被修改。
zh_hant: 螢幕錄影已安全儲存且不會被修改。

# recording.transcription.save-button
source: Save Transcript
de: Transkript speichern
es: Guardar transcripción
fr: Enregistrer la transcription
ja: 文字起こしを保存
ko: 녹취록 저장
ru: Сохранить расшифровку
vi: Lưu bản chép lời
zh_hans: 保存文字稿
zh_hant: 儲存逐字稿

# recording.transcription.save-panel-title
source: Save Recording Transcript
de: Aufnahmetranskript speichern
es: Guardar transcripción de la grabación
fr: Enregistrer la transcription de l’enregistrement
ja: 録画の文字起こしを保存
ko: 녹화 녹취록 저장
ru: Сохранить расшифровку записи
vi: Lưu bản chép lời ghi màn hình
zh_hans: 保存录屏文字稿
zh_hant: 儲存螢幕錄影逐字稿

# recording.transcription.copied
source: Transcript copied
de: Transkript kopiert
es: Transcripción copiada
fr: Transcription copiée
ja: 文字起こしをコピーしました
ko: 녹취록을 복사했습니다
ru: Расшифровка скопирована
vi: Đã sao chép bản chép lời
zh_hans: 文字稿已复制
zh_hant: 逐字稿已複製

# recording.transcription.saved
source: %@ saved
de: %@ gespeichert
es: %@ guardado
fr: %@ enregistré
ja: %@ を保存しました
ko: %@ 저장됨
ru: %@ сохранен
vi: Đã lưu %@
zh_hans: 已保存 %@
zh_hant: 已儲存 %@

# recording.transcription.save-failed
source: Could not save the transcript. Choose another location and try again.
de: Das Transkript konnte nicht gespeichert werden. Wählen Sie einen anderen Speicherort und versuchen Sie es erneut.
es: No se pudo guardar la transcripción. Elige otra ubicación e inténtalo de nuevo.
fr: Impossible d’enregistrer la transcription. Choisissez un autre emplacement et réessayez.
ja: 文字起こしを保存できませんでした。別の場所を選んでもう一度お試しください。
ko: 녹취록을 저장할 수 없습니다. 다른 위치를 선택하고 다시 시도하세요.
ru: Не удалось сохранить расшифровку. Выберите другое место и повторите попытку.
vi: Không thể lưu bản chép lời. Hãy chọn vị trí khác rồi thử lại.
zh_hans: 无法保存文字稿，请选择其他位置后重试。
zh_hant: 無法儲存逐字稿，請選擇其他位置後再試一次。

# recording.transcription.error-invalid-configuration
source: Configure the Volcengine API Key and Model ID in Agent settings before enabling transcription.
de: Konfigurieren Sie vor der Transkription den Volcengine-API-Schlüssel und die Modell-ID in den Agent-Einstellungen.
es: Configura la clave API y el ID del modelo de Volcengine en Agent antes de activar la transcripción.
fr: Configurez la clé API et l’ID du modèle Volcengine dans Agent avant d’activer la transcription.
ja: 文字起こしを有効にする前に、Agent設定でVolcengine API KeyとモデルIDを設定してください。
ko: 받아쓰기를 켜기 전에 Agent 설정에서 Volcengine API Key와 모델 ID를 설정하세요.
ru: Перед включением расшифровки укажите ключ API и ID модели Volcengine в настройках Agent.
vi: Cấu hình API Key và ID mô hình Volcengine trong Agent trước khi bật chép lời.
zh_hans: 开启转写前，请在 Agent 设置中配置火山 API Key 和模型 ID。
zh_hant: 開啟轉寫前，請在 Agent 設定中配置火山 API Key 和模型 ID。

# recording.transcription.error-invalid-recording
source: The completed recording cannot be read.
de: Die fertige Aufnahme kann nicht gelesen werden.
es: No se puede leer la grabación terminada.
fr: Impossible de lire l’enregistrement terminé.
ja: 完了した録画を読み取れません。
ko: 완료된 녹화를 읽을 수 없습니다.
ru: Не удается прочитать завершенную запись.
vi: Không thể đọc bản ghi đã hoàn tất.
zh_hans: 无法读取已完成的录屏文件。
zh_hant: 無法讀取已完成的螢幕錄影檔案。

# recording.transcription.error-no-audio
source: This recording does not contain a readable audio track.
de: Diese Aufnahme enthält keine lesbare Audiospur.
es: Esta grabación no contiene una pista de audio legible.
fr: Cet enregistrement ne contient aucune piste audio lisible.
ja: この録画には読み取り可能な音声トラックがありません。
ko: 이 녹화에는 읽을 수 있는 오디오 트랙이 없습니다.
ru: В этой записи нет доступной аудиодорожки.
vi: Bản ghi này không có bản âm thanh có thể đọc.
zh_hans: 录屏中没有可读取的音轨。
zh_hant: 螢幕錄影中沒有可讀取的音軌。

# recording.transcription.error-audio-too-long
source: Volcengine simultaneous interpretation supports recordings up to two hours.
de: Volcengine-Simultandolmetschen unterstützt Aufnahmen bis zu zwei Stunden.
es: La interpretación simultánea de Volcengine admite grabaciones de hasta dos horas.
fr: L’interprétation simultanée Volcengine prend en charge les enregistrements de deux heures maximum.
ja: Volcengine の同時通訳は 2 時間以内の録音に対応しています。
ko: Volcengine 동시통역은 최대 2시간 길이의 녹음을 지원합니다.
ru: Синхронный перевод Volcengine поддерживает записи длительностью до двух часов.
vi: Phiên dịch đồng thời của Volcengine hỗ trợ bản ghi dài tối đa hai giờ.
zh_hans: 火山引擎同声传译仅支持两小时以内的录音。
zh_hant: 火山引擎同聲傳譯僅支援兩小時以內的錄音。

# recording.transcription.error-audio-decode
source: The recording audio could not be decoded for transcription.
de: Die Audiospur der Aufnahme konnte nicht für die Transkription decodiert werden.
es: No se pudo decodificar el audio de la grabación para transcribirlo.
fr: Impossible de décoder l’audio de l’enregistrement pour la transcription.
ja: 文字起こし用に録画音声をデコードできませんでした。
ko: 녹화 오디오를 녹취용으로 디코딩할 수 없습니다.
ru: Не удалось декодировать аудио записи для расшифровки.
vi: Không thể giải mã âm thanh bản ghi để chép lời.
zh_hans: 无法解码录屏音轨。
zh_hant: 無法解碼螢幕錄影音軌。

# recording.transcription.error-connection
source: Could not connect to Volcengine simultaneous interpretation. Check the network, credentials, model access, and invite-only service entitlement.
de: Keine Verbindung zum Volcengine-Simultandolmetschen möglich. Prüfen Sie Netzwerk, Anmeldedaten, Modellzugriff und die Freischaltung des Einladungsdienstes.
es: No se pudo conectar con la interpretación simultánea de Volcengine. Revisa la red, las credenciales, el acceso al modelo y la habilitación del servicio por invitación.
fr: Impossible de se connecter à l’interprétation simultanée Volcengine. Vérifiez le réseau, les identifiants, l’accès au modèle et l’éligibilité au service sur invitation.
ja: Volcengine の同時通訳に接続できません。ネットワーク、認証情報、モデル権限、招待制サービスの利用資格を確認してください。
ko: Volcengine 동시통역에 연결할 수 없습니다. 네트워크, 자격 증명, 모델 권한 및 초대형 서비스 사용 자격을 확인하세요.
ru: Не удалось подключиться к синхронному переводу Volcengine. Проверьте сеть, учетные данные, доступ к модели и право на участие в закрытом тестировании.
vi: Không thể kết nối phiên dịch đồng thời Volcengine. Hãy kiểm tra mạng, thông tin xác thực, quyền mô hình và quyền dùng dịch vụ thử nghiệm theo lời mời.
zh_hans: 无法连接火山引擎同声传译。请检查网络、凭证、模型权限和邀测资格。
zh_hant: 無法連線火山引擎同聲傳譯。請檢查網路、憑證、模型權限和邀測資格。

# recording.transcription.error-service
source: Volcengine error (%@): %@
de: Volcengine-Fehler (%@): %@
es: Error de Volcengine (%@): %@
fr: Erreur Volcengine (%@) : %@
ja: Volcengine エラー（%@）：%@
ko: Volcengine 오류(%@): %@
ru: Ошибка Volcengine (%@): %@
vi: Lỗi Volcengine (%@): %@
zh_hans: 火山引擎错误（%@）：%@
zh_hant: 火山引擎錯誤（%@）：%@

# recording.transcription.error-invalid-response
source: Volcengine returned an invalid transcription response.
de: Volcengine hat eine ungültige Transkriptionsantwort zurückgegeben.
es: Volcengine devolvió una respuesta de transcripción no válida.
fr: Volcengine a renvoyé une réponse de transcription invalide.
ja: Volcengine から無効な文字起こし応答が返されました。
ko: Volcengine이 잘못된 녹취 응답을 반환했습니다.
ru: Volcengine вернул недопустимый ответ расшифровки.
vi: Volcengine trả về phản hồi chép lời không hợp lệ.
zh_hans: 火山引擎返回了无效的文字稿响应。
zh_hant: 火山引擎傳回了無效的逐字稿回應。

# recording.transcription.error-response-too-large
source: The returned transcript exceeded ShotPaste's safety limit.
de: Das zurückgegebene Transkript überschreitet die Sicherheitsgrenze von ShotPaste.
es: La transcripción devuelta superó el límite de seguridad de ShotPaste.
fr: La transcription renvoyée dépasse la limite de sécurité de ShotPaste.
ja: 返された文字起こしが ShotPaste の安全上限を超えました。
ko: 반환된 녹취록이 ShotPaste의 안전 크기 제한을 초과했습니다.
ru: Размер полученной расшифровки превысил безопасный предел ShotPaste.
vi: Bản chép lời trả về vượt quá giới hạn an toàn của ShotPaste.
zh_hans: 返回的文字稿超过安全大小限制。
zh_hant: 傳回的逐字稿超過安全大小限制。

# recording.transcription.error-empty-transcript
source: No speech was detected in the recording.
de: In der Aufnahme wurde keine Sprache erkannt.
es: No se detectó voz en la grabación.
fr: Aucune parole n’a été détectée dans l’enregistrement.
ja: 録画から音声を検出できませんでした。
ko: 녹화에서 음성이 감지되지 않았습니다.
ru: В записи не обнаружена речь.
vi: Không phát hiện lời nói trong bản ghi.
zh_hans: 录屏中没有识别到语音。
zh_hant: 螢幕錄影中未識別到語音。

# recording.transcription.error-timeout
source: Transcription timed out before Volcengine finished processing the audio.
de: Die Transkription wurde beendet, bevor Volcengine die Audiospur vollständig verarbeitet hatte.
es: La transcripción agotó el tiempo antes de que Volcengine terminara de procesar el audio.
fr: La transcription a expiré avant que Volcengine ne termine le traitement de l’audio.
ja: Volcengine の音声処理が完了する前に文字起こしがタイムアウトしました。
ko: Volcengine의 오디오 처리가 끝나기 전에 녹취 시간이 초과되었습니다.
ru: Время ожидания истекло до завершения обработки аудио в Volcengine.
vi: Đã hết thời gian trước khi Volcengine xử lý xong âm thanh.
zh_hans: 文字稿生成超时。
zh_hant: 逐字稿產生逾時。

# recording.transcription.enable-video
source: Transcribe screen recordings
de: Bildschirmaufnahmen transkribieren
es: Transcribir grabaciones de pantalla
fr: Transcrire les enregistrements d’écran
ja: 画面収録を文字起こし
ko: 화면 녹화 받아쓰기
ru: Расшифровывать записи экрана
vi: Chép lời bản ghi màn hình
zh_hans: 录屏完成后转写
zh_hant: 錄影完成後轉寫

# recording.transcription.processing-failed
source: AI processing failed. The original transcript is preserved. Check the Agent API configuration.
de: KI-Verarbeitung fehlgeschlagen. Das Originaltranskript bleibt erhalten. Prüfen Sie die Agent-API-Einstellungen.
es: Falló el procesamiento con IA. Se conserva la transcripción original. Revisa la configuración de la API del Agent.
fr: Le traitement IA a échoué. La transcription originale est conservée. Vérifiez la configuration de l’API Agent.
ja: AI処理に失敗しました。元の文字起こしは保持されています。Agent APIの設定を確認してください。
ko: AI 처리에 실패했습니다. 원본 텍스트는 보존됩니다. Agent API 설정을 확인하세요.
ru: Ошибка обработки ИИ. Исходная расшифровка сохранена. Проверьте настройки API Agent.
vi: Xử lý AI thất bại. Bản chép lời gốc được giữ lại. Hãy kiểm tra cấu hình API Agent.
zh_hans: 智能处理失败，原始文字稿已保留。请检查 Agent API 配置。
zh_hant: 智慧處理失敗，原始文字稿已保留。請檢查 Agent API 設定。

# recording-toolbar.format-section
source: Format
es: Formato
ja: 形式
ko: 체재
ru: Формат
vi: Định dạng
zh_hans: 格式
zh_hant: 格式

# recording-toolbar.output-video
source: Video
es: Vídeo
fr: Vidéo
ja: ビデオ
ko: 비디오
ru: Видео
zh_hans: 视频
zh_hant: 影片

# recording-toolbar.system-audio
source: System Audio
es: Audio del sistema
fr: Audio système
ja: システムオーディオ
ko: 시스템 오디오
ru: Системный звук
vi: Âm thanh hệ thống
zh_hans: 系统音频
zh_hant: 系統音頻

# audio-recording.system-audio
source: System audio
es: Audio del sistema
fr: Audio système
ja: システムオーディオ
ko: 시스템 오디오
ru: Системный звук
vi: Âm thanh hệ thống
zh_hans: 系统音频
zh_hant: 系統音訊

# recording-toolbar.output-gif
source: GIF
ru: Гиф
zh_hans: 动图
zh_hant: 動圖

# recording.cloud.account-title
source: Volcengine
zh_hans: 火山引擎
zh_hant: 火山引擎
